{"class_name": "Model", "config": {"name": "retinanet", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "padding_conv12", "class_name": "ZeroPadding2D", "config": {"name": "padding_conv12", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "conv12", "class_name": "Conv2D", "config": {"name": "conv12", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding_conv12", 0, 0, {}]]]}, {"name": "bn_conv12", "class_name": "BatchNormalization", "config": {"name": "bn_conv12", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["conv12", 0, 0, {}]]]}, {"name": "conv1_relu2", "class_name": "Activation", "config": {"name": "conv1_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_conv12", 0, 0, {}]]]}, {"name": "pool12", "class_name": "MaxPooling2D", "config": {"name": "pool12", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_relu2", 0, 0, {}]]]}, {"name": "res2a_branch2a2", "class_name": "Conv2D", "config": {"name": "res2a_branch2a2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool12", 0, 0, {}]]]}, {"name": "bn2a_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2a_branch2a2", 0, 0, {}]]]}, {"name": "res2a_branch2a_relu2", "class_name": "Activation", "config": {"name": "res2a_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a2", 0, 0, {}]]]}, {"name": "padding2a_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding2a_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2a_branch2a_relu2", 0, 0, {}]]]}, {"name": "res2a_branch2b2", "class_name": "Conv2D", "config": {"name": "res2a_branch2b2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2a_branch2b2", 0, 0, {}]]]}, {"name": "bn2a_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2a_branch2b2", 0, 0, {}]]]}, {"name": "res2a_branch2b_relu2", "class_name": "Activation", "config": {"name": "res2a_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b2", 0, 0, {}]]]}, {"name": "res2a_branch2c2", "class_name": "Conv2D", "config": {"name": "res2a_branch2c2", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2a_branch2b_relu2", 0, 0, {}]]]}, {"name": "res2a_branch12", "class_name": "Conv2D", "config": {"name": "res2a_branch12", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool12", 0, 0, {}]]]}, {"name": "bn2a_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2a_branch2c2", 0, 0, {}]]]}, {"name": "bn2a_branch12", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch12", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2a_branch12", 0, 0, {}]]]}, {"name": "res2a2", "class_name": "Add", "config": {"name": "res2a2", "trainable": true}, "inbound_nodes": [[["bn2a_branch2c2", 0, 0, {}], ["bn2a_branch12", 0, 0, {}]]]}, {"name": "res2a_relu2", "class_name": "Activation", "config": {"name": "res2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res2a2", 0, 0, {}]]]}, {"name": "res2b_branch2a2", "class_name": "Conv2D", "config": {"name": "res2b_branch2a2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2a_relu2", 0, 0, {}]]]}, {"name": "bn2b_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2b_branch2a2", 0, 0, {}]]]}, {"name": "res2b_branch2a_relu2", "class_name": "Activation", "config": {"name": "res2b_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a2", 0, 0, {}]]]}, {"name": "padding2b_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding2b_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2b_branch2a_relu2", 0, 0, {}]]]}, {"name": "res2b_branch2b2", "class_name": "Conv2D", "config": {"name": "res2b_branch2b2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2b_branch2b2", 0, 0, {}]]]}, {"name": "bn2b_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2b_branch2b2", 0, 0, {}]]]}, {"name": "res2b_branch2b_relu2", "class_name": "Activation", "config": {"name": "res2b_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b2", 0, 0, {}]]]}, {"name": "res2b_branch2c2", "class_name": "Conv2D", "config": {"name": "res2b_branch2c2", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2b_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn2b_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2b_branch2c2", 0, 0, {}]]]}, {"name": "res2b2", "class_name": "Add", "config": {"name": "res2b2", "trainable": true}, "inbound_nodes": [[["bn2b_branch2c2", 0, 0, {}], ["res2a_relu2", 0, 0, {}]]]}, {"name": "res2b_relu2", "class_name": "Activation", "config": {"name": "res2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res2b2", 0, 0, {}]]]}, {"name": "res2c_branch2a2", "class_name": "Conv2D", "config": {"name": "res2c_branch2a2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2b_relu2", 0, 0, {}]]]}, {"name": "bn2c_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2c_branch2a2", 0, 0, {}]]]}, {"name": "res2c_branch2a_relu2", "class_name": "Activation", "config": {"name": "res2c_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a2", 0, 0, {}]]]}, {"name": "padding2c_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding2c_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2c_branch2a_relu2", 0, 0, {}]]]}, {"name": "res2c_branch2b2", "class_name": "Conv2D", "config": {"name": "res2c_branch2b2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2c_branch2b2", 0, 0, {}]]]}, {"name": "bn2c_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2c_branch2b2", 0, 0, {}]]]}, {"name": "res2c_branch2b_relu2", "class_name": "Activation", "config": {"name": "res2c_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b2", 0, 0, {}]]]}, {"name": "res2c_branch2c2", "class_name": "Conv2D", "config": {"name": "res2c_branch2c2", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2c_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn2c_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res2c_branch2c2", 0, 0, {}]]]}, {"name": "res2c2", "class_name": "Add", "config": {"name": "res2c2", "trainable": true}, "inbound_nodes": [[["bn2c_branch2c2", 0, 0, {}], ["res2b_relu2", 0, 0, {}]]]}, {"name": "res2c_relu2", "class_name": "Activation", "config": {"name": "res2c_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res2c2", 0, 0, {}]]]}, {"name": "res3a_branch2a2", "class_name": "Conv2D", "config": {"name": "res3a_branch2a2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2c_relu2", 0, 0, {}]]]}, {"name": "bn3a_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3a_branch2a2", 0, 0, {}]]]}, {"name": "res3a_branch2a_relu2", "class_name": "Activation", "config": {"name": "res3a_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a2", 0, 0, {}]]]}, {"name": "padding3a_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding3a_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3a_branch2a_relu2", 0, 0, {}]]]}, {"name": "res3a_branch2b2", "class_name": "Conv2D", "config": {"name": "res3a_branch2b2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3a_branch2b2", 0, 0, {}]]]}, {"name": "bn3a_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3a_branch2b2", 0, 0, {}]]]}, {"name": "res3a_branch2b_relu2", "class_name": "Activation", "config": {"name": "res3a_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b2", 0, 0, {}]]]}, {"name": "res3a_branch2c2", "class_name": "Conv2D", "config": {"name": "res3a_branch2c2", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3a_branch2b_relu2", 0, 0, {}]]]}, {"name": "res3a_branch12", "class_name": "Conv2D", "config": {"name": "res3a_branch12", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2c_relu2", 0, 0, {}]]]}, {"name": "bn3a_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3a_branch2c2", 0, 0, {}]]]}, {"name": "bn3a_branch12", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch12", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3a_branch12", 0, 0, {}]]]}, {"name": "res3a2", "class_name": "Add", "config": {"name": "res3a2", "trainable": true}, "inbound_nodes": [[["bn3a_branch2c2", 0, 0, {}], ["bn3a_branch12", 0, 0, {}]]]}, {"name": "res3a_relu2", "class_name": "Activation", "config": {"name": "res3a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3a2", 0, 0, {}]]]}, {"name": "res3b_branch2a2", "class_name": "Conv2D", "config": {"name": "res3b_branch2a2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3a_relu2", 0, 0, {}]]]}, {"name": "bn3b_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3b_branch2a2", 0, 0, {}]]]}, {"name": "res3b_branch2a_relu2", "class_name": "Activation", "config": {"name": "res3b_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a2", 0, 0, {}]]]}, {"name": "padding3b_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding3b_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3b_branch2a_relu2", 0, 0, {}]]]}, {"name": "res3b_branch2b2", "class_name": "Conv2D", "config": {"name": "res3b_branch2b2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3b_branch2b2", 0, 0, {}]]]}, {"name": "bn3b_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3b_branch2b2", 0, 0, {}]]]}, {"name": "res3b_branch2b_relu2", "class_name": "Activation", "config": {"name": "res3b_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b2", 0, 0, {}]]]}, {"name": "res3b_branch2c2", "class_name": "Conv2D", "config": {"name": "res3b_branch2c2", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3b_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn3b_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3b_branch2c2", 0, 0, {}]]]}, {"name": "res3b2", "class_name": "Add", "config": {"name": "res3b2", "trainable": true}, "inbound_nodes": [[["bn3b_branch2c2", 0, 0, {}], ["res3a_relu2", 0, 0, {}]]]}, {"name": "res3b_relu2", "class_name": "Activation", "config": {"name": "res3b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3b2", 0, 0, {}]]]}, {"name": "res3c_branch2a2", "class_name": "Conv2D", "config": {"name": "res3c_branch2a2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3b_relu2", 0, 0, {}]]]}, {"name": "bn3c_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3c_branch2a2", 0, 0, {}]]]}, {"name": "res3c_branch2a_relu2", "class_name": "Activation", "config": {"name": "res3c_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a2", 0, 0, {}]]]}, {"name": "padding3c_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding3c_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3c_branch2a_relu2", 0, 0, {}]]]}, {"name": "res3c_branch2b2", "class_name": "Conv2D", "config": {"name": "res3c_branch2b2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3c_branch2b2", 0, 0, {}]]]}, {"name": "bn3c_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3c_branch2b2", 0, 0, {}]]]}, {"name": "res3c_branch2b_relu2", "class_name": "Activation", "config": {"name": "res3c_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b2", 0, 0, {}]]]}, {"name": "res3c_branch2c2", "class_name": "Conv2D", "config": {"name": "res3c_branch2c2", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3c_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn3c_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3c_branch2c2", 0, 0, {}]]]}, {"name": "res3c2", "class_name": "Add", "config": {"name": "res3c2", "trainable": true}, "inbound_nodes": [[["bn3c_branch2c2", 0, 0, {}], ["res3b_relu2", 0, 0, {}]]]}, {"name": "res3c_relu2", "class_name": "Activation", "config": {"name": "res3c_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3c2", 0, 0, {}]]]}, {"name": "res3d_branch2a2", "class_name": "Conv2D", "config": {"name": "res3d_branch2a2", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3c_relu2", 0, 0, {}]]]}, {"name": "bn3d_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3d_branch2a2", 0, 0, {}]]]}, {"name": "res3d_branch2a_relu2", "class_name": "Activation", "config": {"name": "res3d_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a2", 0, 0, {}]]]}, {"name": "padding3d_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding3d_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3d_branch2a_relu2", 0, 0, {}]]]}, {"name": "res3d_branch2b2", "class_name": "Conv2D", "config": {"name": "res3d_branch2b2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3d_branch2b2", 0, 0, {}]]]}, {"name": "bn3d_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3d_branch2b2", 0, 0, {}]]]}, {"name": "res3d_branch2b_relu2", "class_name": "Activation", "config": {"name": "res3d_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b2", 0, 0, {}]]]}, {"name": "res3d_branch2c2", "class_name": "Conv2D", "config": {"name": "res3d_branch2c2", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3d_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn3d_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res3d_branch2c2", 0, 0, {}]]]}, {"name": "res3d2", "class_name": "Add", "config": {"name": "res3d2", "trainable": true}, "inbound_nodes": [[["bn3d_branch2c2", 0, 0, {}], ["res3c_relu2", 0, 0, {}]]]}, {"name": "res3d_relu2", "class_name": "Activation", "config": {"name": "res3d_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res3d2", 0, 0, {}]]]}, {"name": "res4a_branch2a2", "class_name": "Conv2D", "config": {"name": "res4a_branch2a2", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3d_relu2", 0, 0, {}]]]}, {"name": "bn4a_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4a_branch2a2", 0, 0, {}]]]}, {"name": "res4a_branch2a_relu2", "class_name": "Activation", "config": {"name": "res4a_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a2", 0, 0, {}]]]}, {"name": "padding4a_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding4a_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4a_branch2a_relu2", 0, 0, {}]]]}, {"name": "res4a_branch2b2", "class_name": "Conv2D", "config": {"name": "res4a_branch2b2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4a_branch2b2", 0, 0, {}]]]}, {"name": "bn4a_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4a_branch2b2", 0, 0, {}]]]}, {"name": "res4a_branch2b_relu2", "class_name": "Activation", "config": {"name": "res4a_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b2", 0, 0, {}]]]}, {"name": "res4a_branch2c2", "class_name": "Conv2D", "config": {"name": "res4a_branch2c2", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res4a_branch2b_relu2", 0, 0, {}]]]}, {"name": "res4a_branch12", "class_name": "Conv2D", "config": {"name": "res4a_branch12", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3d_relu2", 0, 0, {}]]]}, {"name": "bn4a_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4a_branch2c2", 0, 0, {}]]]}, {"name": "bn4a_branch12", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch12", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4a_branch12", 0, 0, {}]]]}, {"name": "res4a2", "class_name": "Add", "config": {"name": "res4a2", "trainable": true}, "inbound_nodes": [[["bn4a_branch2c2", 0, 0, {}], ["bn4a_branch12", 0, 0, {}]]]}, {"name": "res4a_relu2", "class_name": "Activation", "config": {"name": "res4a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["res4a2", 0, 0, {}]]]}, {"name": "res4b_branch2a2", "class_name": "Conv2D", "config": {"name": "res4b_branch2a2", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res4a_relu2", 0, 0, {}]]]}, {"name": "bn4b_branch2a2", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2a2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4b_branch2a2", 0, 0, {}]]]}, {"name": "res4b_branch2a_relu2", "class_name": "Activation", "config": {"name": "res4b_branch2a_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a2", 0, 0, {}]]]}, {"name": "padding4b_branch2b2", "class_name": "ZeroPadding2D", "config": {"name": "padding4b_branch2b2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4b_branch2a_relu2", 0, 0, {}]]]}, {"name": "res4b_branch2b2", "class_name": "Conv2D", "config": {"name": "res4b_branch2b2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4b_branch2b2", 0, 0, {}]]]}, {"name": "bn4b_branch2b2", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2b2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4b_branch2b2", 0, 0, {}]]]}, {"name": "res4b_branch2b_relu2", "class_name": "Activation", "config": {"name": "res4b_branch2b_relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2b2", 0, 0, {}]]]}, {"name": "res4b_branch2c2", "class_name": "Conv2D", "config": {"name": "res4b_branch2c2", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res4b_branch2b_relu2", 0, 0, {}]]]}, {"name": "bn4b_branch2c2", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2c2", "trainable": false, "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": true}, "inbound_nodes": [[["res4b_branch2c2", 0, 0, {}]]]}, {"name": "res4b2", "class_name": "Add", "config": {"name": "res4b2", "trainable": true}, "inbound_nodes": [[["bn4b_branch2c2", 0, 0, {}], ["res4a_relu2", 0, 0, {}]]]}, {"name": "res4b_relu2", "class_name": "Activation", "config": {"name": "res4b_relu2", "trainable": true, "activation": "relu"}, 